Revit 2024 API
ExportLineweightTable Members
The ExportLineweightTable type exposes the following members.
Constructors
Name | Description
ExportLineweightTable
 Constructs a new ExportLineweightTable with default settings.
Methods
Name | Description
Add
 Inserts a (key, info) pair into Export line weight table.
Clear
 Removes all contents stored in Export line weight table.
ContainsKey
 Checks whether a line weight key exists in the table.
Dispose
Releases all resources used by the ExportLineweightTable
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetExportLineweightInfo
 Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetKeys
 Gets all the keys stored in the map.
GetLineweightTableIterator
Returns a ExportLineweightTableIterator that iterates through the collection.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetValues
 Returns all the values stored in the map.
Remove
 Removes the pair (key, info) corresponding to the given ExportLineweightKey.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Count
 Count of the items contained in the collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Item
 A copy of the ExportLineweightInfo for the line weight's ExportLineweightKey.
See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace